print("Користувач вводить рядок з клавіатури англійською мовою.\n "
"Потрібно порахувати кількість голосних букв у введеному рядку."
"\nРезультат: вивести на екран число всіх голосних букв в рядку.")

str = input("Input english words")
# a = str - почему если просать так, то программа не работает? ведь вводим мы строку и если это обозначить повторно - на что это влияет?
s = str.lower()
a = s.count("a")
e = s.count("e")
i = s.count("i")
o = s.count("o")
u = s.count("u")
y = s.count("y")
z = a + e + i + o + u + y

print("Голосних букв", z)

